Tekla Open API Reference for Tekla Structures 2025
Identifier Constructor (Guid)
 Constructs an identifier with the given GUID.
 Namespace: Tekla.Structures
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Identifier(
	Guid guid
)
Public Sub New (
	guid As Guid
)
Parameters
guid
Type: System.Guid
The GUID to be used.
See Also
Reference
Identifier Class
Identifier Overload
Tekla.Structures Namespace